; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	thermograph3 - mode
	thermograph2 - mode
	spectrograph1 - mode
	thermograph4 - mode
	infrared5 - mode
	image6 - mode
	thermograph0 - mode
	infrared7 - mode
	GroundStation6 - direction
	Star2 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star7 - direction
	Star0 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 image6)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph4)
	(supports instrument2 image6)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared7)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 thermograph0)
	(supports instrument4 image6)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star7)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument5 infrared5)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star7)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Star8 image6)
	(have_image Star8 spectrograph1)
	(have_image Planet9 thermograph3)
	(have_image Planet10 thermograph2)
	(have_image Planet10 spectrograph1)
	(have_image Star11 spectrograph1)
	(have_image Star11 image6)
	(have_image Star12 thermograph2)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 9
2. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 9
3. (turn_to satellite2 star11 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star11)
   goals met: 0 of 9
4. (take_image satellite2 star11 instrument4 image6)
   added: (have_image star11 image6)
   goals met: 1 of 9
5. (turn_to satellite2 planet10 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet10)
   goals met: 1 of 9
6. (turn_to satellite0 star2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star2)
   goals met: 2 of 9
7. (take_image satellite2 planet10 instrument4 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 3 of 9
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 9
9. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 3 of 9
10. (turn_to satellite0 planet10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet10)
   goals met: 2 of 9
11. (take_image satellite0 planet10 instrument0 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 3 of 9
12. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   goals met: 3 of 9
13. (take_image satellite0 planet9 instrument0 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 4 of 9
14. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 4 of 9
15. (take_image satellite0 star11 instrument0 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 5 of 9
16. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 5 of 9
17. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 6 of 9
18. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 7 of 9
19. (turn_to satellite2 star12 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star12)
   goals met: 7 of 9
20. (take_image satellite2 star12 instrument4 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 8 of 9
21. (turn_to satellite2 star8 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star8)
   goals met: 8 of 9
22. (take_image satellite2 star8 instrument4 image6)
   added: (have_image star8 image6)
   goals met: 9 of 9
